kimcnama/embedded_driver_dev/stm32f4xx_drivers/Src/008psi_cmd_handling.c
/*
 * 008psi_cmd_handling.c
 *
 *  Created on: 7 Jan 2023
 *      Author: kieranmc
 */

#include <string.h>
#include "stm32f407xx.h"

// command codes
#define COMMAND_LED_CTRL		0x50
#define COMMAND_SENSOR_READ		0x51
#define COMMAND_LED_READ		0x52
#define COMMAND_PRINT			0x53
#define COMMAND_ID_READ			0x54

#define LED_ON					1
#define LED_OFF					0

// arduino analog pins
#define ANALOG_PIN0				0
#define ANALOG_PIN1				1
#define ANALOG_PIN2				2
#define ANALOG_PIN3				3
#define ANALOG_PIN4				4

// arduino led
#define LED_PIN					9


void delay(void) {
	for (uint32_t i = 0; i < 500000 / 2; ++i);
}

void SPI2_GPIOInits(void) {
	GPIO_Handle_t SPIPins;
	SPIPins.pGPIOx = GPIOB;
	SPIPins.GPIO_PingConfig.GPIO_PinMode = GPIO_MODE_ALTFN;
	SPIPins.GPIO_PingConfig.GPIO_PinAltFunMode = 5;
	SPIPins.GPIO_PingConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	SPIPins.GPIO_PingConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;
	SPIPins.GPIO_PingConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;

	// SCLK
	SPIPins.GPIO_PingConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&SPIPins);

	// MOSI
	SPIPins.GPIO_PingConfig.GPIO_PinNumber = GPIO_PIN_NO_15;
	GPIO_Init(&SPIPins);

	// MISO
	SPIPins.GPIO_PingConfig.GPIO_PinNumber = GPIO_PIN_NO_14;
	GPIO_Init(&SPIPins);

	// NSS
	SPIPins.GPIO_PingConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&SPIPins);
}

void SPI2_Inits(void) {
	SPI_Handle_t SPI2Handle;
	SPI2Handle.pSPIx = SPI2;

	SPI2Handle.SPIConfig.SPI_BusConfig = SPI_BUS_CONFIG_FD;
	SPI2Handle.SPIConfig.SPI_DeviceMode = SPI_DEVICE_MODE_MASTER;
	SPI2Handle.SPIConfig.SPI_SclkSpeed = SPI_SCLK_SPEED_DIV8; // 8 MHz
	SPI2Handle.SPIConfig.SPI_DFF = SPI_DFF_8BITS;
	SPI2Handle.SPIConfig.SPI_CPOL = SPI_CPOL_LO;
	SPI2Handle.SPIConfig.SPI_CPHA = SPI_CPHA_LO;
	SPI2Handle.SPIConfig.SPI_DFF = SPI_SSM_DI;	// Hardware slave management

	SPI_Init(&SPI2Handle);
}

void GPIO_ButtonInit() {
	GPIO_Handle_t GPIObtn;

	GPIObtn.pGPIOx = GPIOA;
	GPIObtn.GPIO_PingConfig.GPIO_PinNumber = GPIO_PIN_NO_0;
	GPIObtn.GPIO_PingConfig.GPIO_PinMode = GPIO_MODE_IN;
	GPIObtn.GPIO_PingConfig.GPIO_PinSpeed = GPIO_SPEED_FAST;
	GPIObtn.GPIO_PingConfig.GPIO_PinPuPdControl = GPIO_NO_PUPD;

	GPIO_Init(&GPIObtn);
}

uint8_t SPI_VerifyResponse(uint8_t ackbyte) {
	if (ackbyte == 0xF5) {
		// ack
		return 1;
	} else {
		// nack
		return 0;
	}
}

int main(void) {

	uint8_t dummy_write = 0xFF;
	uint8_t dummy_read = 0xFF;

	GPIO_ButtonInit();

	// Init GPIO pins to behave as SPI2 pins
	SPI2_GPIOInits();

	// Init SPI2 peripheral parameters
	SPI2_Inits();

	// makes NSS signal internally high and avoids error
	SPI_SSIConfig(SPI2, ENABLE);

	while(1) {
		while( ! GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		// avoid de-bouncing related issues with delay of 200ms
		delay();

		//  enable SSOE
		SPI_SSOEConfig(SPI2, ENABLE);

		// enable SPI2 peripheral
		SPI_PeripheralControl(SPI2, ENABLE);

		// 1. CMD_LED_CTRL		<pin no(1)>		<value(1)>
		uint8_t commandcode = COMMAND_LED_CTRL;
		uint8_t ackbyte;
		uint8_t args[2];

		// send command code
		SPI_SendData(SPI2, &commandcode, 1);

		// prev send will RXNE, so do a dummy read to clear off RXNE
		SPI_ReceiveData(SPI2, &dummy_read, 1);

		// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
		SPI_SendData(SPI2, &dummy_write, 1);
		SPI_ReceiveData(SPI2, &ackbyte, 1);

		// If response is ack
		if ( SPI_VerifyResponse(ackbyte) ) {
			// send arguments
			args[0] = LED_PIN;
			args[1] = LED_ON;
			SPI_SendData(SPI2, args, 2);
		}
		// END OF 1. CMD_LED_CTRL		<pin no(1)>		<value(1)>

		// 2. CMD_SENSOR_READ		<pin no(1)>		<value(1)>

		// wait until button pressed
		while( ! GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		// avoid de-bouncing related issues with delay of 200ms
		delay();

		// send command code
		commandcode = COMMAND_SENSOR_READ;
		SPI_SendData(SPI2, &commandcode, 1);

		// prev send will RXNE, so do a dummy read to clear off RXNE
		SPI_ReceiveData(SPI2, &dummy_read, 1);

		// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
		SPI_SendData(SPI2, &dummy_write, 1);
		SPI_ReceiveData(SPI2, &ackbyte, 1);

		// If response is ack
		if ( SPI_VerifyResponse(ackbyte) ) {
			// send arguments
			args[0] = ANALOG_PIN0;
			SPI_SendData(SPI2, args, 1);

			// prev send will RXNE, so do a dummy read to clear off RXNE
			SPI_ReceiveData(SPI2, &dummy_read, 1);

			// insert some delay so that slave can ready with data
			delay();

			// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
			SPI_SendData(SPI2, &dummy_write, 1);
			uint8_t analog_read;
			SPI_ReceiveData(SPI2, &analog_read, 1);
		}

		// END OF 2. CMD_SENSOR_READ		<pin no(1)>		<value(1)>
		// 3. CMD_LED_READ					<pin no(1)>

		// wait until button pressed
		while( ! GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		// avoid de-bouncing related issues with delay of 200ms
		delay();

		// send command code
		commandcode = COMMAND_LED_READ;
		SPI_SendData(SPI2, &commandcode, 1);

		// prev send will RXNE, so do a dummy read to clear off RXNE
		SPI_ReceiveData(SPI2, &dummy_read, 1);

		// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
		SPI_SendData(SPI2, &dummy_write, 1);
		SPI_ReceiveData(SPI2, &ackbyte, 1);

		// If response is ack
		if ( SPI_VerifyResponse(ackbyte) ) {
			// send arguments
			args[0] = LED_PIN;
			SPI_SendData(SPI2, args, 1);

			// prev send will RXNE, so do a dummy read to clear off RXNE
			SPI_ReceiveData(SPI2, &dummy_read, 1);

			// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
			SPI_SendData(SPI2, &dummy_write, 1);
			uint8_t led_status;
			SPI_ReceiveData(SPI2, &led_status, 1);
		}

		// END OF 3. CMD_LED_READ					<pin no(1)>
		// 4. COMMAND_PRINT				<pin no(1)>		<value(1)>

		// wait until button pressed
		while( ! GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		// avoid de-bouncing related issues with delay of 200ms
		delay();

		// send command code
		commandcode = COMMAND_PRINT;
		SPI_SendData(SPI2, &commandcode, 1);

		// prev send will RXNE, so do a dummy read to clear off RXNE
		SPI_ReceiveData(SPI2, &dummy_read, 1);

		// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
		SPI_SendData(SPI2, &dummy_write, 1);
		SPI_ReceiveData(SPI2, &ackbyte, 1);

		uint8_t message[] = "Hello ! How are you ??";

		// If response is ack
		if ( SPI_VerifyResponse(ackbyte) ) {
			// send arguments
			args[0] = strlen((char*)message);
			SPI_SendData(SPI2, args, 1); // send length
			SPI_SendData(SPI2, message, args[0]); // send string
		}

		// END OF 4. COMMAND_PRINT				<pin no(1)>		<value(1)>
		// 5. CMD_IS_READ

		// wait until button pressed
		while( ! GPIO_ReadFromInputPin(GPIOA, GPIO_PIN_NO_0));
		// avoid de-bouncing related issues with delay of 200ms
		delay();

		// send command code
		commandcode = COMMAND_ID_READ;
		SPI_SendData(SPI2, &commandcode, 1);

		// prev send will RXNE, so do a dummy read to clear off RXNE
		SPI_ReceiveData(SPI2, &dummy_read, 1);

		// send some dummy bits (1 byte) to fetch response from slave (ACK or NACK), need to shift it out of slaves register
		SPI_SendData(SPI2, &dummy_write, 1);
		SPI_ReceiveData(SPI2, &ackbyte, 1);

		uint8_t id[10];
		uint32_t i = 0;

		// If response is ack
		if ( SPI_VerifyResponse(ackbyte) ) {
			for (i = 0; i < 10; ++i) {
				// send dummy byte to fetch data from slave
				SPI_SendData(SPI2, &dummy_write, 1); // send length
				SPI_ReceiveData(SPI2, &id[i], 1);
			}
			id[10] = '\0';
		}

		// END OF 5. CMD_IS_READ

		// confirm SPI not busy before closing
		while ( SPI_GetFlagStatus(SPI2, SPI_BUSY_FLAG) );

		// disable SPI2 peripheral
		SPI_PeripheralControl(SPI2, DISABLE);
	}

	return 0;
}
